import re

def validate_input(field, value):
    if field == "name":
        if not re.match(r'^[\u0600-\u06FF\s]+$', value):
            return "نام و نام خانوادگی باید تنها شامل حروف فارسی باشد."
    elif field == "student_id":
        if not re.match(r'^\d{8,9}$', value):
            return "شماره دانشجویی باید بین ۸ تا ۹ رقم باشد."
    elif field == "national_id":
        if not re.match(r'^\d{10}$', value):
            return "کد ملی باید ۱۰ رقم باشد."
    elif field == "room_block":
        room_list = [101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120,
                     121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
                     201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220,
                     221, 222, 223, 224, 225, 226, 227, 228, 229, 230,
                     301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320,
                     321, 322, 323, 324, 325, 326, 327, 328, 329, 330,
                     401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420,
                     421, 422, 423, 424, 425, 426, 427, 428, 429, 430]
        if not re.match(r'^[1-2]{1}-[0-9]{1,3}$', value) or int(value.split('-')[1]) not in room_list:
            return "شماره اتاق و بلوک باید به فرمت صحیح باشد، مانند 229-1."
    return None
